# initializing taps and support commands
brew "mas"

# shell essentials
brew "zsh"
brew "tmux"
brew "git"
brew "coreutils"
brew "openssl"
brew "wget"
brew "curl"
brew "tree"
brew "cmake"
brew "make"
brew "texinfo"
brew "ninja"
brew "gettext"
brew "vim"

# tools
brew "prettyping"
brew "htop"
brew "ncdu"
brew "fzf"
brew "diff-so-fancy"
brew "jq"

# security key requirements
brew "openssh"
brew "libfido2"
brew "gnupg"

# development tools
brew "gcc"
brew "llvm"
brew "n"
brew "yarn"
brew "php"
brew "python3"
brew "openjdk@17"
brew "ant"
brew "maven"
cask "docker"

# neovim dependencies
brew "fd"
brew "ripgrep"
brew "tree-sitter"
